In [1]:
import pandas as pd
people = {
    "first": ["john","dane", "jack"],
    "last": ["doe","martin","smith"],
    "email": ["johndoe@gmail.com", "danemartin@gmail.com","jacksmith@gmail.com"]
}

In [2]:
df = pd.DataFrame(people)

In [3]:
df

  first    last                 email
0  john     doe     johndoe@gmail.com
1  dane  martin  danemartin@gmail.com
2  jack   smith   jacksmith@gmail.com

In [4]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [5]:
# Update All columns

df.columns = ["first_name", "last_name", "email"]
df

  first_name last_name                 email
0       john       doe     johndoe@gmail.com
1       dane    martin  danemartin@gmail.com
2       jack     smith   jacksmith@gmail.com

In [6]:
# Make upper case all the columns using list comprehension

df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                 EMAIL
0       john       doe     johndoe@gmail.com
1       dane    martin  danemartin@gmail.com
2       jack     smith   jacksmith@gmail.com

In [7]:
# Replace UserScores(_) with spaces in column name

df.columns = df.columns.str.replace(" ", "_")
df

  FIRST_NAME LAST_NAME                 EMAIL
0       john       doe     johndoe@gmail.com
1       dane    martin  danemartin@gmail.com
2       jack     smith   jacksmith@gmail.com

In [8]:
# Update Only Few Columns Name
# Rename few columns name

df.rename(columns={"FIRST_NAME":"first", "LAST_NAME":"last"}, inplace=True)

In [9]:
df

  first    last                 EMAIL
0  john     doe     johndoe@gmail.com
1  dane  martin  danemartin@gmail.com
2  jack   smith   jacksmith@gmail.com

In [10]:
df.rename(columns={"FIRST_NAME":"first", "LAST_NAME":"last", "EMAIL":"email"}, inplace=True)
df

  first    last                 email
0  john     doe     johndoe@gmail.com
1  dane  martin  danemartin@gmail.com
2  jack   smith   jacksmith@gmail.com

In [11]:
# updating data in rows

df.loc[2] = ["ajay", "thakur", "ajay@email.com"]
df

  first    last                 email
0  john     doe     johndoe@gmail.com
1  dane  martin  danemartin@gmail.com
2  ajay  thakur        ajay@email.com

In [12]:
# Update by column name

df.loc[2, ['first', 'last', 'email']] = ['jack','smith','jacksmith@email.com']
df

  first    last                 email
0  john     doe     johndoe@gmail.com
1  dane  martin  danemartin@gmail.com
2  jack   smith   jacksmith@email.com

In [13]:
# Making Email UpperCase by using email

def update_email(email):
    return email.upper()

In [14]:
df["email"] = df["email"].apply(update_email)
df

  first    last                 email
0  john     doe     JOHNDOE@GMAIL.COM
1  dane  martin  DANEMARTIN@GMAIL.COM
2  jack   smith   JACKSMITH@EMAIL.COM

In [15]:
# To make email lower by using lambda function

df['email'] = df["email"].apply(lambda x: x.lower())
df

  first    last                 email
0  john     doe     johndoe@gmail.com
1  dane  martin  danemartin@gmail.com
2  jack   smith   jacksmith@email.com

In [16]:
df.applymap(len)

   first  last  email
0      4     3     17
1      4     6     20
2      4     5     19

In [17]:
# map method only works on series

df['first'].map({'john':'john(updated)', "dane": "dane(updated)", "jack":"jack(updated)"})

0    john(updated)
1    dane(updated)
2    jack(updated)
Name: first, dtype: object

In [18]:
df['first'].map({'john':'john(updated)', "dane": "dane(updated)",})

0    john(updated)
1    dane(updated)
2              NaN
Name: first, dtype: object

In [19]:
# Using Replace instead of map

df["first"] = df['first'].replace({'john':'john(updated)', "dane": "dane(updated)",})

In [20]:
df

           first    last                 email
0  john(updated)     doe     johndoe@gmail.com
1  dane(updated)  martin  danemartin@gmail.com
2           jack   smith   jacksmith@email.com